[
  {
    "Name": "Zillow Data Ingestion & Analytics Pipeline",
    "Desc": "Implemented a Zillow data analytics pipeline using various AWS services. Extracted real estate data from the Zillow API. Performed ETL processes using Apache Airflow on EC2, leveraging AWS Lambda for data transformation tasks. Loaded the transformed data into Amazon Redshift for storage and analysis. Utilized Amazon QuickSight for visualizing the data, providing insightful real estate market trends. This scalable pipeline processes over 50,000 records monthly, ensuring efficient data handling and insightful reporting.",
    "GithubLink": "https://github.com/abhishekshah25/zillow-data-pipeline",
    "Demo": "https://github.com/abhishekshah25/zillow-data-pipeline/blob/main/README.md",
    "ImgSrc": "./zillow.jpg"
  },
  {
    "Name": "RedFin Data Analytics Pipeline",
    "Desc": "Designed a Redfin data analytics pipeline using six different tools and platforms. Extracted real estate data from the Redfin API. Performed ETL processes using Apache Airflow on EC2, leveraging EMR for data processing tasks. Loaded the transformed data into Snowflake via Snowpipe for storage and analysis. Utilized Power BI for visualizing the data, providing insightful market trends. This scalable pipeline efficiently handles over 200,000 records monthly, ensuring comprehensive data analysis and reporting.",
    "GithubLink": "https://github.com/abhishekshah25/redfin-data-pipeline",
    "Demo": "https://github.com/abhishekshah25/redfin-data-pipeline/blob/main/README.md",
    "ImgSrc": "./RedFin.jpg"
  },
  {
    "Name": "Medallion architecture based Data Pipeline",
    "Desc": "Crafted a Medallion Architecture project revolutionizing data operations with seamless integration of DBT on Azure Databricks. Orchestrated sophisticated data modeling and transformation pipelines with DBT, ensuring data consistency and reliability. Leveraged Azure Data Factory to create data pipelines for scaling data processing and analytics, accelerating insights delivery.",
    "GithubLink": "https://github.com/abhishekshah25/3-layer-Medallion-Data-Pipeline",
    "Demo": "https://github.com/abhishekshah25/3-layer-Medallion-Data-Pipeline/blob/main/README.md",
    "ImgSrc": "./Medallion.png"
  },
  {
    "Name": "Realtime Voting Election System",
    "Desc": "Innovated a Realtime Voting Election System Engine leveraging Python, Streamlit, Kafka, Docker, Spark and Postgres. Utilized Docker for creating and managing the container consisting of Postgres database, Spark nodes and Kafka broker whereas Streamlit was used for the user friendly interface.Managed to achieve exceptional performance, processing up to 10,000 votes at one instance with limited compute power.",
    "GithubLink": "https://github.com/abhishekshah25/vote-stream",
    "Demo": "",
    "ImgSrc": "./voting.jpg"
  },
  {
    "Name": "Realtime Smart City Data Pipeline",
    "Desc": "Engineered a Realtime Smart City Data Pipeline processing over 200+ diverse data streams from sensors and IoT devices across the city. Integrated Kafka for stream processing, Spark for realtime analysis as well as AWS Services such as Glue for ETL, Redshift for data warehouse and Docker for deployment. Attained an impressive processing speed of upto 2,000 data points per minute when used with dummy data of sensors and IoT devices.",
    "GithubLink": "https://github.com/abhishekshah25/smart-city",
    "Demo": "",
    "ImgSrc": "./smart-city.jpg"
  },
  {
    "Name": "BuzzIn",
    "Desc": " A social media app where users can securely sign up, log in, and log out of their accounts. Create, interact with, and share posts while exploring user profiles to discover new connections. Easily search for users, posts, or topics, and stay updated with real-time notifications for new posts, likes, comments, and follows through WebSocket connections.",
    "GithubLink": "https://github.com/abhishekshah25/BuzzIn",
    "Demo": "https://buzz-in.vercel.app/",
    "ImgSrc": "./BuzzIn.png"
  }
]